*> vybe-test: cobol/category_object_oriented_advanced/test_oo_class_def
*> origin: languages/cobol/tests/cobol/test_category_object_oriented_advanced.rs
IDENTIFICATION DIVISION. CLASS-ID. C. ENVIRONMENT DIVISION. CONFIGURATION SECTION. REPOSITORY. CLASS C IS 'C'. IDENTIFICATION DIVISION. FACTORY. PROCEDURE DIVISION. END FACTORY. IDENTIFICATION DIVISION. OBJECT. PROCEDURE DIVISION. END OBJECT. END CLASS C.

