*> vybe-test: cobol/oo_cobol/interface_as_component
*> origin: languages/cobol/tests/cobol/test_oo_cobol.rs

IDENTIFICATION DIVISION.
INTERFACE-ID. SERIALIZABLE.
METHOD-ID. SERIALIZE.
PROCEDURE DIVISION RETURNING WS-JSON.
END METHOD SERIALIZE.
METHOD-ID. DESERIALIZE.
PROCEDURE DIVISION USING WS-JSON.
END METHOD DESERIALIZE.
END INTERFACE SERIALIZABLE.

